# Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
#*Примеры:*

#- 5, 25 -> да
#- 4, 16 -> да
#- 25, 5 -> да
#- 8,9 -> нет




#a = int(input('Введите число' ))
#b = int(input('Введите второе число' ))

#if a*a==b:
#     print (f' - {a}, {b} -> да')
#elif b*b==a:
#     print (f' - {a}, {b} -> да')
#else: 
#    print (f' - {a}, {b} -> нет')


a = int(input('Введите число 1 ' ))
b = int(input('Введите второе число 2' ))
c = int(input('Введите число 3' ))
d = int(input('Введите второе число 4' ))
e = int(input('Введите второе число 5' ))
max = a
if b > max:
    max = b
if c > max:
    max = c
if d > max:
    max = d      
if e > max:
    max = e   
print(max)